nxp-mcuxpresso/mcux-soc-svd/MIMXRT1011/MIMXRT1011.xml
        <register>
          <name>OPACR4</name>
          <description>Off-Platform Peripheral Access Control Registers</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPAC33</name>
              <description>Off-platform Peripheral Access Control 33</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC32</name>
              <description>Off-platform Peripheral Access Control 32</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1</name>
                  <description>This peripheral is write protected. If a write access is attempted, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1</name>
                  <description>This peripheral requires supervisor privilege level for accesses. The master privilege level must indicate supervisor via the hprot[1] access attribute, and the MPROTx[MPL] control bit for the master must be set. If not, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BW1</name>
                  <description>Write accesses to this peripheral are allowed to be buffered by the AIPSTZ.</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="AIPSTZ1">
      <name>AIPSTZ2</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ2_</prependToName>
      <baseAddress>0x4017C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>DCDC</name>
      <description>DCDC</description>
      <groupName>DCDC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DCDC</name>
        <value>69</value>
      </interrupt>
      <registers>
        <register>
          <name>REG0</name>
          <description>DCDC Register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x14030111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWD_ZCD</name>
              <description>Power Down Zero Cross Detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Zero cross detetion function powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Zero cross detetion function powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE_AUTO_CLK_SWITCH</name>
              <description>Disable Auto Clock Switch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>xtal_clk</name>
                  <description>If DISABLE_AUTO_CLK_SWITCH is set to 0 and 24M xtal is OK, the clock source will switch from internal ring OSC to 24M xtal automatically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel_clk</name>
                  <description>If DISABLE_AUTO_CLK_SWITCH is set to 1, SEL_CLK will determine which clock source the DCDC uses</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_CLK</name>
              <description>Select Clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>int_rng_osc</name>
                  <description>DCDC uses internal ring oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xtal_24M</name>
                  <description>DCDC uses 24M xtal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_OSC_INT</name>
              <description>Power down internal osc</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Internal oscillator powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Internal oscillator powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CUR_SNS_CMP</name>
              <description>Power down signal of the current detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Current Detector powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Current Detector powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUR_SNS_THRSH</name>
              <description>Current Sense (detector) Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>select_zero</name>
                  <description>150 mA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_one</name>
                  <description>250 mA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_two</name>
                  <description>350 mA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_three</name>
                  <description>450 mA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_four</name>
                  <description>550 mA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_five</name>
                  <description>650 mA</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_OVERCUR_DET</name>
              <description>Power down overcurrent detection comparator</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overcurrent detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overcurrent detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERCUR_TRIG_ADJ</name>
              <description>Overcurrent Trigger Adjust</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>select_zero</name>
                  <description>In Run Mode, 1 A. In Power Save Mode, 0.25 A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_one</name>
                  <description>In Run Mode, 2 A. In Power Save Mode, 0.25 A</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_two</name>
                  <description>In Run Mode, 1 A. In Power Save Mode, 0.2 A</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>select_three</name>
                  <description>In Run Mode, 2 A. In Power Save Mode, 0.2 A</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CMP_BATT_DET</name>
              <description>Power Down Battery Detection Comparator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Low voltage detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Low voltage detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_LP_OVERLOAD_SNS</name>
              <description>Low Power Overload Sense Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overload Detection in power save mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overload Detection in power save mode enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_HIGH_VOLT_DET</name>
              <description>Power Down High Voltage Detection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overvoltage detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overvoltage detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_OVERLOAD_THRSH</name>
              <description>Low Power Overload Threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>thrsh_32</name>
                  <description>32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>thrsh_64</name>
                  <description>64</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>thrsh_16</name>
                  <description>16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>thrsh_8</name>
                  <description>8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_OVERLOAD_FREQ_SEL</name>
              <description>Low Power Overload Frequency Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>eight_32k_cycle</name>
                  <description>eight 32k cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sixteen_32k_cycle</name>
                  <description>sixteen 32k cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_HIGH_HYS</name>
              <description>Low Power High Hysteric Value</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lp_12p5mV</name>
                  <description>Adjust hysteretic value in low power to 12.5mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lp_25mV</name>
                  <description>Adjust hysteretic value in low power to 25mV</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CMP_OFFSET</name>
              <description>Power down output range comparator</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Output range comparator powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Output range comparator powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALOK_DISABLE</name>
              <description>Disable xtalok detection circuit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable xtalok detection circuit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable xtalok detection circuit and always outputs OK signal &quot;1&quot;</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRENT_ALERT_RESET</name>
              <description>Reset Current Alert Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_reset</name>
                  <description>Current Alert Signal not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Current Alert Signal reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_24M_OK</name>
              <description>24M XTAL OK</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>int_rng_osc</name>
                  <description>DCDC uses internal ring OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xtal_24M</name>
                  <description>DCDC uses xtal 24M</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS_DC_OK</name>
              <description>DCDC Output OK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_settled</name>
                  <description>DCDC is settling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>settled</name>
                  <description>DCDC already settled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
