nxp-mcuxpresso/mcux-soc-svd/MIMXRT1011/MIMXRT1011.xml
          <register>
            <name>CTX_RGD_W1</name>
            <description>AES Region Descriptor Word1</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3F8</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VLD</name>
                <description>Valid</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_VALID</name>
                    <description>Context is invalid.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALID</name>
                    <description>Context is valid.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADE</name>
                <description>AES Decryption Enable.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BYPASS</name>
                    <description>Bypass the fetched data.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DECRYPT</name>
                    <description>Perform the CTR-AES128 mode decryption on the fetched data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RO</name>
                <description>Read-Only</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>The context registers can be accessed normally (as defined by SR[RRAM]).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESTRICT</name>
                    <description>The context registers are read-only and accesses may be further restricted based on SR[RRAM].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENDADDR</name>
                <description>End Address</description>
                <bitOffset>10</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>IOMUXC_SNVS_GPR</name>
      <description>IOMUXC</description>
      <groupName>IOMUXC_SNVS_GPR</groupName>
      <prependToName>IOMUXC_SNVS_GPR_</prependToName>
      <baseAddress>0x400A4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPR0</name>
          <description>GPR0 General Purpose Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR1</name>
          <description>GPR1 General Purpose Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR2</name>
          <description>GPR2 General Purpose Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR3</name>
          <description>GPR3 General Purpose Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPSR_MODE_ENABLE</name>
              <description>Set to enable LPSR mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSR_MODE_ENABLE_0</name>
                  <description>SNVS domain will reset when system reset happens</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSR_MODE_ENABLE_1</name>
                  <description>SNVS domain will only reset with SNVS POR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_STATUS_CAPT_CLR</name>
              <description>DCDC captured status clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POR_PULL_TYPE</name>
              <description>POR_B pad control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_PULL_TYPE_0</name>
                  <description>100 Ohm pull up enabled for POR_B always</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_PULL_TYPE_1</name>
                  <description>Disable pull in SNVS mode, 100 Ohm pull up enabled otherwise</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_PULL_TYPE_2</name>
                  <description>Disable pull of POR_B always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_PULL_TYPE_3</name>
                  <description>100 Ohm pull down enabled in SNVS mode, 100 Ohm pull up enabled otherwise</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_IN_LOW_VOL</name>
              <description>DCDC_IN low voltage detect.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_IN_LOW_VOL_0</name>
                  <description>DCDC_IN is ok</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_IN_LOW_VOL_1</name>
                  <description>DCDC_IN is too low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_OVER_CUR</name>
              <description>DCDC output over current alert</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_OVER_CUR_0</name>
                  <description>No over current detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_OVER_CUR_1</name>
                  <description>Over current detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_OVER_VOL</name>
              <description>DCDC output over voltage alert</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_OVER_VOL_0</name>
                  <description>No over voltage detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_OVER_VOL_1</name>
                  <description>Over voltage detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDC_STS_DC_OK</name>
              <description>DCDC status OK</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC_STS_DC_OK_0</name>
                  <description>DCDC is ramping up and not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC_STS_DC_OK_1</name>
                  <description>DCDC is ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
