nxp-mcuxpresso/mcux-soc-svd/MIMXRT1011/MIMXRT1011.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>IOMUXC_GPR</name>
      <description>IOMUXC_GPR</description>
      <groupName>IOMUXC_GPR</groupName>
      <prependToName>IOMUXC_GPR_</prependToName>
      <baseAddress>0x400AC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPR0</name>
          <description>GPR0 General Purpose Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR1</name>
          <description>GPR1 General Purpose Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAI1_MCLK1_SEL</name>
              <description>SAI1 MCLK1 source select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_0</name>
                  <description>ccm.ssi1_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_2</name>
                  <description>ccm.ssi3_clk_root</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_3</name>
                  <description>iomux.sai1_ipg_clk_sai_mclk</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK1_SEL_5</name>
                  <description>iomux.sai3_ipg_clk_sai_mclk</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_MCLK2_SEL</name>
              <description>SAI1 MCLK2 source select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_0</name>
                  <description>ccm.ssi1_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_2</name>
                  <description>ccm.ssi3_clk_root</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_3</name>
                  <description>iomux.sai1_ipg_clk_sai_mclk</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK2_SEL_5</name>
                  <description>iomux.sai3_ipg_clk_sai_mclk</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_MCLK3_SEL</name>
              <description>SAI1 MCLK3 source select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_0</name>
                  <description>ccm.spdif0_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_1</name>
                  <description>SPDIF_EXT_CLK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_2</name>
                  <description>spdif.spdif_srclk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK3_SEL_3</name>
                  <description>spdif.spdif_outclock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_MCLK3_SEL</name>
              <description>SAI3 MCLK3 source select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_0</name>
                  <description>ccm.spdif0_clk_root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_1</name>
                  <description>SPDIF_EXT_CLK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_2</name>
                  <description>spdif.spdif_srclk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK3_SEL_3</name>
                  <description>spdif.spdif_outclock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GINT</name>
              <description>Global Interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GINT_0</name>
                  <description>Global interrupt request is not asserted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GINT_1</name>
                  <description>Global interrupt request is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_MCLK_DIR</name>
              <description>sai1.MCLK signal direction control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_MCLK_DIR_0</name>
                  <description>sai1.MCLK is input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_MCLK_DIR_1</name>
                  <description>sai1.MCLK is output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_MCLK_DIR</name>
              <description>sai3.MCLK signal direction control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI3_MCLK_DIR_0</name>
                  <description>sai3.MCLK is input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_MCLK_DIR_1</name>
                  <description>sai3.MCLK is output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXC_MON</name>
              <description>Exclusive monitor response select of illegal command</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXC_MON_0</name>
                  <description>OKAY response</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXC_MON_1</name>
                  <description>SLVError response</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_FORCE_HCLK_EN</name>
              <description>Arm CM7 platform AHB clock enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_FORCE_HCLK_EN_0</name>
                  <description>AHB clock is not running (gated) when CM7 is sleeping and TCM is not accessible.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_FORCE_HCLK_EN_1</name>
                  <description>AHB clock is running (enabled) when CM7 is sleeping and TCM is accessible.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR2</name>
          <description>GPR2 General Purpose Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXBS_P_M0_HIGH_PRIORITY</name>
              <description>AXBS_P M0 master has higher priority.Do not set both M1 and M0 to high priority.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_P_M0_HIGH_PRIORITY_0</name>
                  <description>AXBS_P M0 master doesn't have high priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_P_M0_HIGH_PRIORITY_1</name>
                  <description>AXBS_P M0 master has high priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_P_M1_HIGH_PRIORITY</name>
              <description>AXBS_P M1 master has higher priority.Do not set both M1 and M0 to high priority.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_P_M1_HIGH_PRIORITY_0</name>
                  <description>AXBS_P M1 master does not have high priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_P_M1_HIGH_PRIORITY_1</name>
                  <description>AXBS_P M1 master has high priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_P_FORCE_ROUND_ROBIN</name>
              <description>Force Round Robin in AXBS_P. This bit can override master M0 M1 high priority configuration.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_P_FORCE_ROUND_ROBIN_0</name>
                  <description>AXBS_P masters are not arbitored in round robin, depending on M0/M1 master priority settings.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_P_FORCE_ROUND_ROBIN_1</name>
                  <description>AXBS_P masters are arbitored in round robin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L2_MEM_EN_POWERSAVING</name>
              <description>Enable power saving features on L2 memory</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L2_MEM_EN_POWERSAVING_0</name>
                  <description>Enters power saving mode only when chip is in SUSPEND mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_MEM_EN_POWERSAVING_1</name>
                  <description>Controlled by L2_MEM_DEEPSLEEP bitfield</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AUTO_CLK_GATING_EN</name>
              <description>Automatically gate off RAM clock when RAM is not accessed.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_AUTO_CLK_GATING_EN_0</name>
                  <description>disable automatically gate off RAM clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AUTO_CLK_GATING_EN_1</name>
                  <description>enable automatically gate off RAM clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L2_MEM_DEEPSLEEP</name>
              <description>This bit controls how memory (OCRAM) enters Deep Sleep mode (shutdown periphery power, but maintain memory contents, outputs of memory are pulled low</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L2_MEM_DEEPSLEEP_0</name>
                  <description>No force sleep control supported, memory deep sleep mode only entered when whole system in stop mode (OCRAM in normal mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_MEM_DEEPSLEEP_1</name>
                  <description>Force memory into deep sleep mode (OCRAM in power saving mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_CLK_DIV</name>
              <description>Divider ratio control for mclk from hmclk</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_0</name>
                  <description>mclk frequency = hmclk frequency</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_1</name>
                  <description>mclk frequency = 1/2 * hmclk frequency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_2</name>
                  <description>mclk frequency = 1/3 * hmclk frequency</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_CLK_DIV_255</name>
                  <description>mclk frequency = 1/256 * hmclk frequency</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_SW_RST</name>
              <description>MQS software reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_SW_RST_0</name>
                  <description>Exit software reset for MQS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_SW_RST_1</name>
                  <description>Enable software reset for MQS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_EN</name>
              <description>MQS enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_EN_0</name>
                  <description>Disable MQS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_EN_1</name>
                  <description>Enable MQS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_OVERSAMPLE</name>
              <description>Medium Quality Sound (MQS) Oversample</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_OVERSAMPLE_0</name>
                  <description>32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_OVERSAMPLE_1</name>
                  <description>64</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR3</name>
          <description>GPR3 General Purpose Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCP_KEY_SEL</name>
              <description>Select 128-bit DCP key from 256-bit key from SNVS Master Key</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCP_KEY_SEL_0</name>
                  <description>Select [127:0] from SNVS Master Key as DCP key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCP_KEY_SEL_1</name>
                  <description>Select [255:128] from SNVS Master Key as DCP key</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
