nxp-mcuxpresso/mcux-soc-svd/MIMXRT1011/MIMXRT1011.xml
        <register>
          <name>GPR4</name>
          <description>GPR4 General Purpose Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDMA_STOP_REQ</name>
              <description>EDMA stop request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDMA_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDMA_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRNG_STOP_REQ</name>
              <description>TRNG stop request.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRNG_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_STOP_REQ</name>
              <description>SAI1 stop request.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_STOP_REQ</name>
              <description>SAI3 stop request.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI3_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIT_STOP_REQ</name>
              <description>PIT stop request.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIT_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI_STOP_REQ</name>
              <description>FlexSPI stop request.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXSPI_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO1_STOP_REQ</name>
              <description>FlexIO1 stop request.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDMA_STOP_ACK</name>
              <description>EDMA stop acknowledge. This is a status (read-only) bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDMA_STOP_ACK_0</name>
                  <description>EDMA stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDMA_STOP_ACK_1</name>
                  <description>EDMA stop acknowledge is asserted (EDMA is in STOP mode).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRNG_STOP_ACK</name>
              <description>TRNG stop acknowledge</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRNG_STOP_ACK_0</name>
                  <description>TRNG stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_STOP_ACK_1</name>
                  <description>TRNG stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_STOP_ACK</name>
              <description>SAI1 stop acknowledge</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_STOP_ACK_0</name>
                  <description>SAI1 stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_STOP_ACK_1</name>
                  <description>SAI1 stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_STOP_ACK</name>
              <description>SAI3 stop acknowledge</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI3_STOP_ACK_0</name>
                  <description>SAI3 stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI3_STOP_ACK_1</name>
                  <description>SAI3 stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIT_STOP_ACK</name>
              <description>PIT stop acknowledge</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIT_STOP_ACK_0</name>
                  <description>PIT stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_STOP_ACK_1</name>
                  <description>PIT stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI_STOP_ACK</name>
              <description>FLEXSPI stop acknowledge</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXSPI_STOP_ACK_0</name>
                  <description>FLEXSPI stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXSPI_STOP_ACK_1</name>
                  <description>FLEXSPI stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO1_STOP_ACK</name>
              <description>FLEXIO1 stop acknowledge</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_STOP_ACK_0</name>
                  <description>FLEXIO1 stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_STOP_ACK_1</name>
                  <description>FLEXIO1 stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR5</name>
          <description>GPR5 General Purpose Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDOG1_MASK</name>
              <description>WDOG1 Timeout Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG1_MASK_0</name>
                  <description>WDOG1 Timeout behaves normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG1_MASK_1</name>
                  <description>WDOG1 Timeout is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG2_MASK</name>
              <description>WDOG2 Timeout Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG2_MASK_0</name>
                  <description>WDOG2 Timeout behaves normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG2_MASK_1</name>
                  <description>WDOG2 Timeout is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF_1M_CLK_GPT1</name>
              <description>GPT1 1 MHz clock source select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT1_0</name>
                  <description>GPT1 ipg_clk_highfreq driven by IPG_PERCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT1_1</name>
                  <description>GPT1 ipg_clk_highfreq driven by anatop 1 MHz clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF_1M_CLK_GPT2</name>
              <description>GPT2 1 MHz clock source select</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT2_0</name>
                  <description>GPT2 ipg_clk_highfreq driven by IPG_PERCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF_1M_CLK_GPT2_1</name>
                  <description>GPT2 ipg_clk_highfreq driven by anatop 1 MHz clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR6</name>
          <description>GPR6 General Purpose Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_2</name>
              <description>IOMUXC XBAR_INOUT2 function direction select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_2_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_2_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_3</name>
              <description>IOMUXC XBAR_INOUT3 function direction select</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_3_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_3_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
