nxp-mcuxpresso/mcux-soc-svd/MIMXRT1011/MIMXRT1011.xml
        <register>
          <name>MISC1_TOG</name>
          <description>Miscellaneous Register 1</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PFD_480_AUTOGATE_EN</name>
              <description>This enables a feature that will clkgate (reset) all PFD_480 clocks anytime the USB1_PLL_480 is unlocked or powered off</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD_528_AUTOGATE_EN</name>
              <description>This enables a feature that will clkgate (reset) all PFD_528 clocks anytime the PLL_528 is unlocked or powered off</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_TEMPPANIC</name>
              <description>This status bit is set to one when the temperature sensor panic interrupt asserts for a panic high temperature</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_TEMPLOW</name>
              <description>This status bit is set to one when the temperature sensor low interrupt asserts for low temperature</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_TEMPHIGH</name>
              <description>This status bit is set to one when the temperature sensor high interrupt asserts for high temperature</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_ANA_BO</name>
              <description>This status bit is set to one when when any of the analog regulator brownout interrupts assert</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IRQ_DIG_BO</name>
              <description>This status bit is set to one when when any of the digital regulator brownout interrupts assert</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC2</name>
          <description>Miscellaneous Register 2</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x272727</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_BO_OFFSET</name>
              <description>This field defines the brown out voltage offset for the CORE power domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG0_BO_OFFSET_4</name>
                  <description>Brownout offset = 0.100V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_BO_OFFSET_7</name>
                  <description>Brownout offset = 0.175V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG0_BO_STATUS</name>
              <description>Reg0 brownout status bit.Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG0_BO_STATUS_1</name>
                  <description>Brownout, supply is below target minus brownout offset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG0_ENABLE_BO</name>
              <description>Enables the brownout detection.Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG0_OK</name>
              <description>Arm supply Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL3_DISABLE</name>
              <description>When USB is in low power suspend mode this Control bit is used to indicate if other system peripherals require the USB PLL3 clock when the SoC is not in low power mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL3_DISABLE_0</name>
                  <description>PLL3 is being used by peripherals and is enabled when SoC is not in any low power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_DISABLE_1</name>
                  <description>PLL3 can be disabled when the SoC is not in any low power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_BO_OFFSET</name>
              <description>This field defines the brown out voltage offset for the xPU power domain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG1_BO_OFFSET_4</name>
                  <description>Brownout offset = 0.100V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_BO_OFFSET_7</name>
                  <description>Brownout offset = 0.175V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_BO_STATUS</name>
              <description>Reg1 brownout status bit. Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG1_BO_STATUS_1</name>
                  <description>Brownout, supply is below target minus brownout offset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_ENABLE_BO</name>
              <description>Enables the brownout detection.Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG1_OK</name>
              <description>GPU supply Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUDIO_DIV_LSB</name>
              <description>LSB of Post-divider for Audio PLL</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUDIO_DIV_LSB_0</name>
                  <description>divide by 1 (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIO_DIV_LSB_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_BO_OFFSET</name>
              <description>This field defines the brown out voltage offset for the xPU power domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG2_BO_OFFSET_4</name>
                  <description>Brownout offset = 0.100V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_BO_OFFSET_7</name>
                  <description>Brownout offset = 0.175V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_BO_STATUS</name>
              <description>Reg2 brownout status bit.Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG2_ENABLE_BO</name>
              <description>Enables the brownout detection.Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG2_OK</name>
              <description>Signals that the voltage is above the brownout level for the SOC supply</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUDIO_DIV_MSB</name>
              <description>MSB of Post-divider for Audio PLL</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUDIO_DIV_MSB_0</name>
                  <description>divide by 1 (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIO_DIV_MSB_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG0_STEP_TIME</name>
              <description>Number of clock periods (24MHz clock).Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>64_CLOCKS</name>
                  <description>64</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_CLOCKS</name>
                  <description>128</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256_CLOCKS</name>
                  <description>256</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_CLOCKS</name>
                  <description>512</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_STEP_TIME</name>
              <description>Number of clock periods (24MHz clock).Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>64_CLOCKS</name>
                  <description>64</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_CLOCKS</name>
                  <description>128</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256_CLOCKS</name>
                  <description>256</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_CLOCKS</name>
                  <description>512</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_STEP_TIME</name>
              <description>Number of clock periods (24MHz clock).Not related to CCM. See Power Management Unit (PMU)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>64_CLOCKS</name>
                  <description>64</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_CLOCKS</name>
                  <description>128</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256_CLOCKS</name>
                  <description>256</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_CLOCKS</name>
                  <description>512</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
