nxp-mcuxpresso/mcux-soc-svd/MIMXRT1011/MIMXRT1011.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX</name>
      <description>DMAMUX</description>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x400EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CHCFG[%s]</name>
          <description>Channel index Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>DMA Channel Source (Slot Number)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ON</name>
              <description>DMA Channel Always Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A_ON_0</name>
                  <description>DMA Channel Always ON function is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_ON_1</name>
                  <description>DMA Channel Always ON function is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG</name>
              <description>DMA Channel Trigger Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_0</name>
                  <description>Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_1</name>
                  <description>Triggering is enabled. If triggering is enabled and ENBL is set, the DMA_CH_MUX is in Periodic Trigger mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBL</name>
              <description>DMA Mux Channel Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENBL_0</name>
                  <description>DMA Mux channel is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENBL_1</name>
                  <description>DMA Mux channel is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCP</name>
      <description>DCP register reference index</description>
      <groupName>DCP</groupName>
      <prependToName>DCP_</prependToName>
      <baseAddress>0x400F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x434</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DCP</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>DCP_VMI</name>
        <value>51</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>DCP control register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_SET</name>
          <description>DCP control register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_CLR</name>
          <description>DCP control register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_TOG</name>
          <description>DCP control register 0</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_INTERRUPT_ENABLE</name>
              <description>Per-channel interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>CH0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>CH1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>CH2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>CH3</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_CONTEXT_SWITCHING</name>
              <description>Enable automatic context switching for the channels</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_CONTEXT_CACHING</name>
              <description>The software must set this bit to enable the caching of contexts between the operations</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATHER_RESIDUAL_WRITES</name>
              <description>The software must set this bit to enable the ragged writes to the unaligned buffers to be gathered between multiple write operations</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENT_SHA</name>
              <description>Indicates whether the SHA1/SHA2 functions are present.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT_CRYPTO</name>
              <description>Indicates whether the crypto (cipher/hash) functions are present.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for a normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable a normal DCP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
