nxp-mcuxpresso/mcux-soc-svd/MIMXRT1011/MIMXRT1011.xml
        <register>
          <name>FFILT0</name>
          <description>Fault Filter Register</description>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FILT_PER</name>
              <description>Fault Filter Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILT_CNT</name>
              <description>Fault Filter Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSTR</name>
              <description>Fault Glitch Stretch Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Fault input glitch stretching is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Input fault signals will be stretched to at least 2 IPBus clock cycles.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FTST0</name>
          <description>Fault Test Register</description>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FTEST</name>
              <description>Fault Test</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FAULT</name>
                  <description>No fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Cause a simulated fault</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRL20</name>
          <description>Fault Control 2 Register</description>
          <addressOffset>0x194</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>NOCOMB</name>
              <description>No Combinational Path From Fault Input To PWM Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>There is a combinational link from the fault inputs to the PWM outputs. The fault inputs are combined with the filtered and latched fault signals to disable the PWM outputs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The direct combinational path from the fault inputs to the PWM outputs is disabled and the filtered and latched fault signals are used to disable the PWM outputs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPDIF</name>
      <description>SPDIF</description>
      <groupName>SPDIF</groupName>
      <prependToName>SPDIF_</prependToName>
      <baseAddress>0x401DC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPDIF</name>
        <value>60</value>
      </interrupt>
      <registers>
        <register>
          <name>SCR</name>
          <description>SPDIF Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USrc_Sel</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USrc_Sel_0</name>
                  <description>No embedded U channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USrc_Sel_1</name>
                  <description>U channel from SPDIF receive block (CD mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USrc_Sel_3</name>
                  <description>U channel from on chip transmitter</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TxSel</name>
              <description>no description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TxSel_0</name>
                  <description>Off and output 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxSel_1</name>
                  <description>Feed-through SPDIFIN</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxSel_5</name>
                  <description>Tx Normal operation</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ValCtrl</name>
              <description>no description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ValCtrl_0</name>
                  <description>Outgoing Validity always set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ValCtrl_1</name>
                  <description>Outgoing Validity always clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_TX_En</name>
              <description>DMA Transmit Request Enable (Tx FIFO empty)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_Rx_En</name>
              <description>DMA Receive Request Enable (RX FIFO full)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxFIFO_Ctrl</name>
              <description>no description available</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TxFIFO_Ctrl_0</name>
                  <description>Send out digital zero on SPDIF Tx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxFIFO_Ctrl_1</name>
                  <description>Tx Normal operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxFIFO_Ctrl_2</name>
                  <description>Reset to 1 sample remaining</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>soft_reset</name>
              <description>When write 1 to this bit, it will cause SPDIF software reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOW_POWER</name>
              <description>When write 1 to this bit, it will cause SPDIF enter low-power mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxFIFOEmpty_Sel</name>
              <description>no description available</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TxFIFOEmpty_Sel_0</name>
                  <description>Empty interrupt if 0 sample in Tx left and right FIFOs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxFIFOEmpty_Sel_1</name>
                  <description>Empty interrupt if at most 4 sample in Tx left and right FIFOs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxFIFOEmpty_Sel_2</name>
                  <description>Empty interrupt if at most 8 sample in Tx left and right FIFOs</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxFIFOEmpty_Sel_3</name>
                  <description>Empty interrupt if at most 12 sample in Tx left and right FIFOs</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TxAutoSync</name>
              <description>no description available</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TxAutoSync_0</name>
                  <description>Tx FIFO auto sync off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxAutoSync_1</name>
                  <description>Tx FIFO auto sync on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxAutoSync</name>
              <description>no description available</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxAutoSync_0</name>
                  <description>Rx FIFO auto sync off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxAutoSync_1</name>
                  <description>RxFIFO auto sync on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFOFull_Sel</name>
              <description>no description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxFIFOFull_Sel_0</name>
                  <description>Full interrupt if at least 1 sample in Rx left and right FIFOs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFIFOFull_Sel_1</name>
                  <description>Full interrupt if at least 4 sample in Rx left and right FIFOs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFIFOFull_Sel_2</name>
                  <description>Full interrupt if at least 8 sample in Rx left and right FIFOs</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFIFOFull_Sel_3</name>
                  <description>Full interrupt if at least 16 sample in Rx left and right FIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFO_Rst</name>
              <description>no description available</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxFIFO_Rst_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFIFO_Rst_1</name>
                  <description>Reset register to 1 sample remaining</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFO_Off_On</name>
              <description>no description available</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxFIFO_Off_On_0</name>
                  <description>SPDIF Rx FIFO is on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFIFO_Off_On_1</name>
                  <description>SPDIF Rx FIFO is off. Does not accept data from interface</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFO_Ctrl</name>
              <description>no description available</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxFIFO_Ctrl_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFIFO_Ctrl_1</name>
                  <description>Always read zero from Rx data register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCD</name>
          <description>CDText Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USyncMode</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USyncMode_0</name>
                  <description>Non-CD data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USyncMode_1</name>
                  <description>CD user channel subcode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRPC</name>
          <description>PhaseConfig Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GainSel</name>
              <description>Gain selection:</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GainSel_0</name>
                  <description>24*(2**10)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GainSel_1</name>
                  <description>16*(2**10)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GainSel_2</name>
                  <description>12*(2**10)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GainSel_3</name>
                  <description>8*(2**10)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GainSel_4</name>
                  <description>6*(2**10)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GainSel_5</name>
                  <description>4*(2**10)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GainSel_6</name>
                  <description>3*(2**10)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>LOCK bit to show that the internal DPLL is locked, read only</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ClkSrc_Sel</name>
              <description>Clock source selection, all other settings not shown are reserved:</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClkSrc_Sel_0</name>
                  <description>if (DPLL Locked) SPDIF_RxClk else REF_CLK_32K (XTALOSC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSrc_Sel_1</name>
                  <description>if (DPLL Locked) SPDIF_RxClk else tx_clk (SPDIF0_CLK_ROOT)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSrc_Sel_3</name>
                  <description>if (DPLL Locked) SPDIF_RxClk else SPDIF_EXT_CLK</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSrc_Sel_5</name>
                  <description>REF_CLK_32K (XTALOSC)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSrc_Sel_6</name>
                  <description>tx_clk (SPDIF0_CLK_ROOT)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClkSrc_Sel_8</name>
                  <description>SPDIF_EXT_CLK</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
